Repository: asidowner/dictionary_service
Catalog: locale/*/LC_MESSAGES/django.po
Languages: ru

source: Identifier
ru: Идентификатор

source: Dictionary version's
ru: Версии справочника

source: Current version
ru: Текущая версия

source: Version start date
ru: Дата начала действия версии

source: Dictionary identifier
ru: Идентификатор справочника

source: Dictionary name
ru: Наименование справочника

source: Dictionaries
ru: Справочники

source: Obtaining a list of dictionaries.
ru: Получение списка справочников.

source: Obtaining a list of dictionaries. An additional option is to retrieve the current ones as of a specified date.
ru: Получение списка справочников. Дополнительно, возможно, получить актуальные на указанную дату.

source: Retrieving elements from a given dictionaries.
ru: Получение элементов заданного справочника.

source: Retrieving elements from a given dictionaries. Can return according to the dictionary version.
ru: Получение элементов заданного справочника. Можно вернуть соответствующие указанной версии.

source: Validation an element
ru: Валидация элемента

source: Validation of a dictionary element is a check that the item with the given code and value is present in the specified version of the dictionary.
ru: Валидация элемента справочника - это проверка на то, что элемент с данным кодом и значением присутствует в указанной версии справочника.

source: Start date in format YYYY-MM-DD. If not passed, all dictionaries are returned.
ru: Дата начала действия в формате ГГГГ-ММ-ДД. Если не указана, все словари будут возвращены.

source: Version of dictionary. If not passed, elements of the current version are returned. The current version is the one whose start date is later than all other versions of the dictionary, but not later than the current date.
ru: Версия справочника. Если не указана, то должны возвращаться элементы текущей версии. Текущей является та версия, дата начала действия которой позже всех остальных версий данного справочника, но не позже текущей даты.

source: Code of a dictionary element
ru: Код элемента справочника

source: Value of a dictionary element
ru: Значение элемента справочника

source: Code
ru: Код

source: Name
ru: Наименование

source: Description
ru: Описание

source: Dictionary
ru: Справочник

source: Version
ru: Версия

source: Date
ru: Дата

source: Dictionary version
ru: Версия справочника

source: Dictionary version identifier
ru: Идентификатор версии справочника

source: Element code
ru: Код элемента

source: Element value
ru: Значение элемента

source: Dictionary element
ru: Элемент справочника

source: Dictionary element's
ru: Элементы справочника

source: Example with current date
ru: Пример с текущей датой

source: Current date
ru: Текущая версия

source: Example successful response
ru: Пример успешного ответа

source: Example response if dictionary not found
ru: Пример ответа если словари не найдены

source: Example dictionary id
ru: Пример идентификатора справочника

source: Example version
ru: Пример версии

source: Example response if elements not found
ru: Пример ответа если элементы не найдены

source: Example code
ru: Код элемента

source: Example value
ru: Значение элемента

source: Example response if required params are not passed
ru: Пример ответа если запрашиваемые параметры не переданы
